dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.h
#ifndef _PY32F0XX_H
#define _PY32F0XX_H

//PY32duino code
// - using PY32F03002/003/030 chip
// - free running systick for ticks
// - 
// - version history
// - v0.1, 07/02/2023: initial port from stm32f0
// - v0.2, 08/15/2023: implemented gpio, timer, and pwm functionalities
// - v0.2a,08/19/2023: added hardware and software RTC support
// v v0.3, 08/20/2023: implemented PLL
//
//
//               PY32F002AF/TSSOP20
//      GND     |=====================|    Vdd
//       |      |                     |     |
//       +------| GND            Vdd  |-----+
//              |                     |
//              |                PA14 |<----- SWCLK (Pin3)
//              |                     |
//       +------| BOOT0          PA13 |<----> SWDIO (Pin2)
//              |                     |
//              |                     |
//              |                 PA4 |--+--> GND
//              |                     |  |
//       +----->| OSCin/PF0       PA3 |--+--> LED
//    [Xtal]    |                     |
//       +-----<| OSCout/PF1          |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |=====================|
//
//
//

#include <py32f0xx.h>						//we use PY32F0
#include <string.h>							//we use strcpy()
#include <stdint.h>							//we use uint types
#include <time.h>							//we use time routines

//hardware configuration
//#define USE_CORETICK						//use coretick/DWT for tick generation - ignored for STM32F0
#define uRAM_SIZE			40				//uart buffer size

//oscillator configuration
#define F_XTAL				10000000ul		//crystal frequency, user-specified
#define F_LSE				32768			//watch crystal frequency, user-specified

//configuration for circular buffer
/*******NOTE********************************/
/******cBUFF_SIZE: must be power of 2*******/
/*******************************************/
#define cBUFF_SIZE 			32				//must be power of 2: 0..256 -> for buffers with more than 256 elements, change data type for writeIndex/readIndex
typedef char cbuffer_t;						//storage unit for the buffer
//end configuration for circular buffer
//end user specification

//pin config
#define U1TX2PIN()					U1TX2PA2()			//PB6, PA2, PA9, PA14, PF1
//#define U1RX2PIN()					U1RX2PB7()			//PB7, PA3, PA10,PA13, PF0
#define U2TX2PIN()					U2TX2PA2()			//PA2, PA14
//#define U2RX2PIN()					U2RX2PA3()			//PA3, PA15

//pwm output pins
//pwm1 otput pins
#define TIM1CH1toPIN()				TIM1CH1toPA3()		//PA8, PA3
//#define TIM1CH2toPIN()				TIM1CH2toPA9()		//PA9, PA13
//#define TIM1CH3toPIN()				TIM1CH3toPA10()		//PA0, PA10, PB6
//#define TIM1CH4toPIN()				TIM1CH4toPA1()		//PA1
//#define TIM1CH1NtoPIN()				TIM1CH1NtoPA7()		//PA0, PA7, PB13
//#define TIM1CH2NtoPIN()				TIM1CH2NtoPB0()		//PA1, PB0
//#define TIM1CH3NtoPIN()				TIM1CH3NtoPB1()		//PB1

//pwm3 output pins
//#define TIM3CH1toPIN()				TIM3CH1toPA6()		//PA2, PA6, PB4
//#define TIM3CH2toPIN()				TIM3CH2toPA7()		//PA5, PA7, PB5
//#define TIM3CH3toPIN()				TIM3CH3toPB0()		//PB0, PF3
//#define TIM3CH4toPIN()				TIM3CH4toPB1()		//PB1

//pwm14 output pins
//#define TIM14CH1toPIN()				TIM14CH1toPA4()		//PA4, PA7, PB1, PF0, PF1

//pwm15 output pins
//#define TIM15CH1toPIN()				TIM15CH1toPA2()		//PA2, PB14
//#define TIM15CH2toPIN()				TIM15CH2toPA3()		//PA3, PB15
//#define TIM15CH1NtoPIN()			TIM15CH1NtoPB15()	//PB15

//pwm16 output pins
//#define TIM16CH1toPIN()				TIM16CH1toPA6()		//PA6, PB8
//#define TIM16CH1NtoPIN()			TIM16CH1NtoPB6()	//PB6

//pwm17 output pins
//#define TIM17CH1toPIN()				TIM17CH1toPA7()		//PA7, PB8
//#define TIM17CH1NtoPIN()			TIM17CH1NtoPB7()	//PB7

//input capture pins

//spi pins
//#define NSS1toPIN()			NSS1toPA4()					//
//#define SCK1toPIN()			SCK1toPA5()					//
//#define MOSI1toPIN()		MOSI1toPA7()				//
//#define MISO1toPIN()		MISO1toPA6()				//
//end spi pins

//i2c pins
#define SCL1toPIN()			SCL1toPA9()					//PA3, PA8, PA9, PA10, PA11, PB6, PB8, PF1
#define SDA1toPIN()			SDA1toPA10()				//PA2, PA9, PA10,PA11, PA12, PB7, PB8, PF0

//mco pin
#define MCOtoPIN()			MCOtoPA8()					//PA1, PA5, PA8, PA9, PA13, PA14, PF2
//end pin configuration

#define F_SYSCLK			(SYSClock())
#define F_HCLK				(AHBClock())
#define F_PCLK				(APBClock())
#define F_CPU				(F_FCLK)					//peripheral block runs at F_PHB - default = F_CPU / 1
#define F_FCLK				F_HCLK
#define F_PLL				PLLClock()
#define F_PHB				(F_APB)						//cpu runs at 8Mhz/2 by default -> Fxtal = 8Mhz. *4 for PLL. RCDIV set to 0 (1:1 postscaler)
#define F_AHB				(F_HCLK)
#define F_APB				(F_PCLK)
#define F_HSE				F_XTAL
#define F_LSI				32768ul						//LSI frequency = 32768, in hz - measured to be 32600Hz
#define F_HSI				F_HSIGet()					//HSI frequency = 24Mhz, in hz - uncalibrated, nominal.
#define F_HSI24				24000000ul					//hsi frequency = 24Mhz
#define F_HSI22				22120000ul					//hsi frequency = 22.12Mhz
#define F_HSI16				16000000ul					//hsi frequency = 16Mhz
#define F_HSI8				8000000ul					//hsi frequency = 8Mhz
#define F_HSI4				4000000ul					//hsi frequency = 4Mhz
#define HSI_FS24			(4<<RCC_ICSCR_HSI_FS_Pos)	//0b100->24Mhz
#define HSI_FS22			(3<<RCC_ICSCR_HSI_FS_Pos)	//0b011->22.12Mhz
#define HSI_FS16			(2<<RCC_ICSCR_HSI_FS_Pos)	//0b010->16Mhz
#define HSI_FS8				(1<<RCC_ICSCR_HSI_FS_Pos)	//0b001->8Mhz
#define HSI_FS4				(0<<RCC_ICSCR_HSI_FS_Pos)	//0b000->4Mhz
#define HSI24TRIM			((*(uint32_t *) 0x1fff0f10) & 0x1fff)	//hsi trim for 24Mhz, [12..0] effective
#define HSI22TRIM			((*(uint32_t *) 0x1fff0f0c) & 0x1fff)	//hsi trim for 22.12Mhz
#define HSI16TRIM			((*(uint32_t *) 0x1fff0f08) & 0x1fff)	//hsi trim for 16Mhz
#define HSI8TRIM			((*(uint32_t *) 0x1fff0f04) & 0x1fff)	//hsi trim for 8Mhz
#define HSI4TRIM			((*(uint32_t *) 0x1fff0f00) & 0x1fff) 	//hsi trim for 4Mhz
#define LSITRIM				((*(uint32_t *) 0x1fff0fa4) & 0x01ff)	//lsi trim
#define F_HCLK8				(F_HCLK/8)
#define F_TIMPCLK			(((RCC->CFGR & RCC_CFGR_PPRE) == RCC_CFGR_PPRE_DIV1)?F_APB:(F_APB*2))
#define F_UART1				(u1FreqGet())
#define F_I2C				((RCC->CFGR3 & RCC_CFGR3_I2C1SW)?F_SYSCLK:F_HSI)
#define PWM_PR				0xffff						//pwm period - don't change
void SystemCoreClockConfig(uint32_t clk);				//change clock
//set hsi frequency
uint32_t F_HSISet(uint32_t f_hsi);						//hsi_fs = HSI_FS24, HSI_FS22, HSI_FS16, HSI_FS8, HSI_FS4
//get hsi frequency
uint32_t F_HSIGet(void);								//hsi_fs = HSI_FS24, HSI_FS22, HSI_FS16, HSI_FS8, HSI_FS4
uint32_t PLLClock(void);
uint32_t SYSClock(void);
uint32_t AHBClock(void);								//get AHB speed
uint32_t APBClock(void);								//get APB speed
uint32_t TIMClock(void);								//get TIM_PCLK speed
uint32_t u1FreqGet(void);								//uart1 speed = APBClock()
void pllSet(void);										//SET_BIT pll, fixed at 2x. Just set Flash latency at 1 (>24Mhz AHBClock)
#define SystemCoreClockHSI()		SystemCoreClockHSI8M()	//default to 8M
#define SystemCoreClockHSI4M()		do {F_HSISet(HSI_FS4); SystemCoreClockConfig(RCC_CFGR_SW_HSI);} while (0)
#define SystemCoreClockHSI8M()		do {F_HSISet(HSI_FS8); SystemCoreClockConfig(RCC_CFGR_SW_HSI);} while (0)
#define SystemCoreClockHSI16M()		do {F_HSISet(HSI_FS16);SystemCoreClockConfig(RCC_CFGR_SW_HSI);} while (0)
#define SystemCoreClockHSI22M()		do {F_HSISet(HSI_FS22);SystemCoreClockConfig(RCC_CFGR_SW_HSI);} while (0)
#define SystemCoreClockHSI24M()		do {F_HSISet(HSI_FS24);SystemCoreClockConfig(RCC_CFGR_SW_HSI);} while (0)
#define SystemCoreClockHSI44M()		SystemCoreClockHSI22Mx2()
#define SystemCoreClockHSI48M()		SystemCoreClockHSI24Mx2()
#define SystemCoreClockHSIPLL()		SystemCoreClockHSI24MPLL()
//PLL input frequency > 16Mhz. Otherwise it does not work
#define SystemCoreClockHSI4MPLL()	do {SystemCoreClockHSI4M();  RCC->PLLCFGR &=~RCC_PLLCFGR_PLLSRC; pllSet(); SystemCoreClockConfig(RCC_CFGR_SW_PLL); SystemCoreClockUpdate();} while (0)
#define SystemCoreClockHSI8MPLL()	do {SystemCoreClockHSI8M();  RCC->PLLCFGR &=~RCC_PLLCFGR_PLLSRC; pllSet(); SystemCoreClockConfig(RCC_CFGR_SW_PLL); SystemCoreClockUpdate();} while (0)
#define SystemCoreClockHSI16MPLL()	do {SystemCoreClockHSI16M(); RCC->PLLCFGR &=~RCC_PLLCFGR_PLLSRC; pllSet(); SystemCoreClockConfig(RCC_CFGR_SW_PLL); SystemCoreClockUpdate();} while (0)
//end PLL input frequency
#define SystemCoreClockHSI22MPLL()	do {SystemCoreClockHSI22M(); RCC->PLLCFGR &=~RCC_PLLCFGR_PLLSRC; pllSet(); SystemCoreClockConfig(RCC_CFGR_SW_PLL); SystemCoreClockUpdate();} while (0)
#define SystemCoreClockHSI24MPLL()	do {SystemCoreClockHSI24M(); RCC->PLLCFGR &=~RCC_PLLCFGR_PLLSRC; pllSet(); SystemCoreClockConfig(RCC_CFGR_SW_PLL); SystemCoreClockUpdate();} while (0)
#define SystemCoreClockHSI16Mx2()	SystemCoreClockHSI16MPLL()
#define SystemCoreClockHSI22Mx2()	SystemCoreClockHSI22MPLL()
#define SystemCoreClockHSI24Mx2()	SystemCoreClockHSI24MPLL()

#define SystemCoreClockHSE()		do {RCC->ECSCR = (RCC->ECSCR &~RCC_ECSCR_HSE_FREQ) | RCC_ECSCR_HSE_FREQx; SystemCoreClockConfig(RCC_CFGR_SW_HSE);} while (0)
//***two conditions: 1) Xtal > 16Mhz, and 2) Flash latency = 1 for AHBClock > 24Mhz***
#define SystemCoreClockHSEPLL()		do {SystemCoreClockHSE();    RCC->PLLCFGR |= RCC_PLLCFGR_PLLSRC; pllSet(); SystemCoreClockUpdate();} while (0)
#define SystemCoreClockLSI()		do {SystemCoreClockConfig(RCC_CFGR_SW_LSI);} while (0)
#define SystemCoreClockLSE()		SystemCoreClockConfig(RCC_CFGR_SW_LSE)
uint32_t HSITrimGet(void);										//((RCC->ICSCR & RCC_ICSCR_HSI_TRIM) >> RCC_ICSCR_HSI_TRIM_Pos)
#define HSITrimSet(trim)			do {RCC->ICSCR = (RCC->ICSCR &~RCC_ICSCR_HSI_TRIM) | (((HSITrimGet() + (trim)) << RCC_ICSCR_HSI_TRIM_Pos) & RCC_ICSCR_HSI_TRIM);} while (0)
#define LSITrimGet()				(LSITRIM)					//((RCC->ICSCR & RCC_ICSCR_LSI_TRIM) >> RCC_ICSCR_LSI_TRIM_Pos)
#define LSITrimSet(trim)			do {RCC->ICSCR = (RCC->ICSCR &~RCC_ICSCR_LSI_TRIM) | (((LSITrimGet() + (trim)) << RCC_ICSCR_LSI_TRIM_Pos) & RCC_ICSCR_LSI_TRIM);} while (0)
//clock switching
#define RCC_CFGR_SW_HSI				(0ul<<RCC_CFGR_SW_Pos)		//HSISYS
#define RCC_CFGR_SW_HSE				(1ul<<RCC_CFGR_SW_Pos)		//HSE
#define RCC_CFGR_SW_PLL				(2ul<<RCC_CFGR_SW_Pos)		//PLL
#define RCC_CFGR_SW_LSI				(3ul<<RCC_CFGR_SW_Pos)		//LSI
#define RCC_CFGR_SW_LSE				(4ul<<RCC_CFGR_SW_Pos)		//LSE
#if F_XTAL > 16000000ul
#define RCC_ECSCR_HSE_FREQx			(3 << RCC_ECSCR_HSE_FREQ_Pos)	//0b11 for 16-24Mhz
#elif F_XTAL > 8000000ul
#define RCC_ECSCR_HSE_FREQx			(2 << RCC_ECSCR_HSE_FREQ_Pos)	//0b10 for 8-16Mhz
#elif F_XTAL > 4000000ul
#define RCC_ECSCR_HSE_FREQx			(1 << RCC_ECSCR_HSE_FREQ_Pos)	//0b01 for 4-8Mhz
#else
#define RCC_ECSCR_HSE_FREQx			(0 << RCC_ECSCR_HSE_FREQ_Pos)	//0b00 for hse off
#endif	//ecscr

//mco - div=0..7->1:1 -> 128:1
#define MCO2NOCLK(div)				do {RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOSEL) | (0<<RCC_CFGR_MCOSEL_Pos); RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOPRE) | (((div) << RCC_CFGR_MCOPRE_Pos) & RCC_CFGR_MCOPRE);} while (0)
#define MCO2SYSCLK(div)				do {RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOSEL) | (1<<RCC_CFGR_MCOSEL_Pos); RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOPRE) | (((div) << RCC_CFGR_MCOPRE_Pos) & RCC_CFGR_MCOPRE);} while (0)
#define MCO2HSI10M(div)				do {RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOSEL) | (2<<RCC_CFGR_MCOSEL_Pos); RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOPRE) | (((div) << RCC_CFGR_MCOPRE_Pos) & RCC_CFGR_MCOPRE);} while (0)
#define MCO2HSI(div)				do {RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOSEL) | (3<<RCC_CFGR_MCOSEL_Pos); RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOPRE) | (((div) << RCC_CFGR_MCOPRE_Pos) & RCC_CFGR_MCOPRE);} while (0)
#define MCO2HSE(div)				do {RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOSEL) | (4<<RCC_CFGR_MCOSEL_Pos); RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOPRE) | (((div) << RCC_CFGR_MCOPRE_Pos) & RCC_CFGR_MCOPRE);} while (0)
#define MCO2PLL(div)				do {RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOSEL) | (5<<RCC_CFGR_MCOSEL_Pos); RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOPRE) | (((div) << RCC_CFGR_MCOPRE_Pos) & RCC_CFGR_MCOPRE);} while (0)
#define MCO2LSI(div)				do {RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOSEL) | (6<<RCC_CFGR_MCOSEL_Pos); RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOPRE) | (((div) << RCC_CFGR_MCOPRE_Pos) & RCC_CFGR_MCOPRE);} while (0)
#define MCO2LSE(div)				do {RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOSEL) | (7<<RCC_CFGR_MCOSEL_Pos); RCC->CFGR = (RCC->CFGR &~RCC_CFGR_MCOPRE) | (((div) << RCC_CFGR_MCOPRE_Pos) & RCC_CFGR_MCOPRE);} while (0)

	//pin config
//uart1/2/3 pin config
#define U1TX2PB6()			pinAFIO(PB6, AFIO0)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 6))) | (/*0b10*/0x02<<(2* 6)); GPIOB->OTYPER &=~(1<< 6); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 6))) | (/*0b01*/0x01<<(2* 6)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 6%8)))) | (0<<(4*( 6%8)));} while (0)	//PB6, AF0
#define U1RX2PB7()			pinAFIO(PB7, AFIO0)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOB->OTYPER &=~(1<< 7); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 7%8)))) | (0<<(4*( 7%8)));} while (0)	//PB7, AF0
#define U1TX2PA2()			pinAFIO(PA2, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 2))) | (/*0b10*/0x02<<(2* 2)); GPIOA->OTYPER &=~(1<< 2); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 2))) | (/*0b01*/0x01<<(2* 2)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 2%8)))) | (1<<(4*( 2%8)));} while (0)	//PA2, AF1
#define U1RX2PA3()			pinAFIO(PA3, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 3))) | (/*0b10*/0x02<<(2* 3)); GPIOA->OTYPER &=~(1<< 3); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 3))) | (/*0b01*/0x01<<(2* 3)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 3%8)))) | (1<<(4*( 3%8)));} while (0)	//PA3, AF1
#define U1TX2PA9()			pinAFIO(PA9, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 9))) | (/*0b10*/0x02<<(2* 9)); GPIOA->OTYPER &=~(1<< 9); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 9))) | (/*0b01*/0x01<<(2* 9)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*( 9%8)))) | (1<<(4*( 9%8)));} while (0)	//PA9, AF1
#define U1RX2PA10()			pinAFIO(PA10,AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*10))) | (/*0b10*/0x02<<(2*10)); GPIOA->OTYPER &=~(1<<10); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*10))) | (/*0b01*/0x01<<(2*10)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(10%8)))) | (1<<(4*(10%8)));} while (0)	//PA10, AF1
#define U1TX2PA14()			pinAFIO(PA14,AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*14))) | (/*0b10*/0x02<<(2*14)); GPIOA->OTYPER &=~(1<<14); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*14))) | (/*0b01*/0x01<<(2*14)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(14%8)))) | (1<<(4*(14%8)));} while (0)	//PA14, AF1
#define U1RX2PA13()			pinAFIO(PA8, AFIO8)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*15))) | (/*0b10*/0x02<<(2*15)); GPIOA->OTYPER &=~(1<<15); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*15))) | (/*0b01*/0x01<<(2*15)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(15%8)))) | (1<<(4*(15%8)));} while (0)	//PA15, AF1
#define U1TX2PF1()			pinAFIO(PF1, AFIO8)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*14))) | (/*0b10*/0x02<<(2*14)); GPIOA->OTYPER &=~(1<<14); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*14))) | (/*0b01*/0x01<<(2*14)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(14%8)))) | (1<<(4*(14%8)));} while (0)	//PA14, AF1
#define U1RX2PF0()			pinAFIO(PF0, AFIO8)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*15))) | (/*0b10*/0x02<<(2*15)); GPIOA->OTYPER &=~(1<<15); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*15))) | (/*0b01*/0x01<<(2*15)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(15%8)))) | (1<<(4*(15%8)));} while (0)	//PA15, AF1

//uart2 pins
#define U2TX2PA2()			pinAFIO(PA2, AFIO4)
#define U2RX2PA3()			pinAFIO(PA3, AFIO4)
#define U2TX2PA14()			pinAFIO(PA14,AFIO4)		//SWCLK pin
#define U2RX2PA15()			pinAFIO(PA15,AFIO4)		

//pwm / oc
//global defines
#define TIM1CH1toPA8()				pinAFIO(PA8, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 8))) | (/*0b10*/0x02<<(2* 8)); GPIOA->OTYPER &=~(1<< 8); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 8))) | (/*0b01*/0x01<<(2* 8)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*( 8%8)))) | (2<<(4*( 8%8)));} while (0)
#define TIM1CH1toPA3()				pinAFIO(PA3, AFIO13)//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 8))) | (/*0b10*/0x02<<(2* 8)); GPIOA->OTYPER &=~(1<< 8); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 8))) | (/*0b01*/0x01<<(2* 8)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*( 8%8)))) | (2<<(4*( 8%8)));} while (0)
#define TIM1CH2toPA9()				pinAFIO(PA9, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 9))) | (/*0b10*/0x02<<(2* 9)); GPIOA->OTYPER &=~(1<< 9); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 9))) | (/*0b01*/0x01<<(2* 9)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*( 9%8)))) | (2<<(4*( 9%8)));} while (0)
#define TIM1CH2toPA13()				pinAFIO(PA13,AFIO13)//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 9))) | (/*0b10*/0x02<<(2* 9)); GPIOA->OTYPER &=~(1<< 9); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 9))) | (/*0b01*/0x01<<(2* 9)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*( 9%8)))) | (2<<(4*( 9%8)));} while (0)
#define TIM1CH2toPB3()				pinAFIO(PB3, AFIO1) //do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 9))) | (/*0b10*/0x02<<(2* 9)); GPIOA->OTYPER &=~(1<< 9); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 9))) | (/*0b01*/0x01<<(2* 9)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*( 9%8)))) | (2<<(4*( 9%8)));} while (0)
#define TIM1CH3toPA0()				pinAFIO(PA0, AFIO13)//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*10))) | (/*0b10*/0x02<<(2*10)); GPIOA->OTYPER &=~(1<<10); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*10))) | (/*0b01*/0x01<<(2*10)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(10%8)))) | (2<<(4*(10%8)));} while (0)
#define TIM1CH3toPA10()				pinAFIO(PA10,AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*10))) | (/*0b10*/0x02<<(2*10)); GPIOA->OTYPER &=~(1<<10); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*10))) | (/*0b01*/0x01<<(2*10)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(10%8)))) | (2<<(4*(10%8)));} while (0)
#define TIM1CH3toPB6()				pinAFIO(PB6, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*10))) | (/*0b10*/0x02<<(2*10)); GPIOA->OTYPER &=~(1<<10); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*10))) | (/*0b01*/0x01<<(2*10)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(10%8)))) | (2<<(4*(10%8)));} while (0)
#define TIM1CH4toPA1()				pinAFIO(PA1, AFIO13)//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2*11))) | (/*0b10*/0x02<<(2*11)); GPIOA->OTYPER &=~(1<<11); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2*11))) | (/*0b01*/0x01<<(2*11)); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f<<(4*(11%8)))) | (2<<(4*(11%8)));} while (0)
#define TIM1CH1NtoPA0()				pinAFIO(PA0, AFIO14)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOA->OTYPER &=~(1<< 7); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 7%8)))) | (2<<(4*( 7%8)));} while (0)
#define TIM1CH1NtoPA7()				pinAFIO(PA7, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOA->OTYPER &=~(1<< 7); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 7%8)))) | (2<<(4*( 7%8)));} while (0)
#define TIM1CH1NtoPB13()			pinAFIO(PB13,AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2*13))) | (/*0b10*/0x02<<(2*13)); GPIOB->OTYPER &=~(1<<13); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2*13))) | (/*0b01*/0x01<<(2*13)); GPIOB->AFR[1] = (GPIOB->AFR[1] &~(0x0f<<(4*(13%8)))) | (2<<(4*(13%8)));} while (0)
#define TIM1CH2NtoPA1()				pinAFIO(PA1, AFIO14)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOA->OTYPER &=~(1<< 7); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 7%8)))) | (2<<(4*( 7%8)));} while (0)
#define TIM1CH2NtoPB0()				pinAFIO(PB0, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 0))) | (/*0b10*/0x02<<(2* 0)); GPIOB->OTYPER &=~(1<< 0); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 0))) | (/*0b01*/0x01<<(2* 0)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 0%8)))) | (2<<(4*( 0%8)));} while (0)
#define TIM1CH3NtoPB1()				pinAFIO(PB1, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 1))) | (/*0b10*/0x02<<(2* 1)); GPIOB->OTYPER &=~(1<< 1); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 1))) | (/*0b01*/0x01<<(2* 1)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 1%8)))) | (2<<(4*( 1%8)));} while (0)

