dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.h
//MODER=/*0b10*/0x02 (alternate function), OTYPER=(push-pull), OSPEEDR = medium speed
//Alternate function = 1, AFR[0]/low byte
#define TIM3CH1toPA2()				pinAFIO(PA2, AFIO13)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 6))) | (/*0b10*/0x02<<(2* 6)); GPIOA->OTYPER &=~(1<< 6); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 6))) | (/*0b01*/0x01<<(2* 6)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 6%8)))) | (1<<(4*( 6%8)));} while (0)
#define TIM3CH1toPA6()				pinAFIO(PA6, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 6))) | (/*0b10*/0x02<<(2* 6)); GPIOA->OTYPER &=~(1<< 6); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 6))) | (/*0b01*/0x01<<(2* 6)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 6%8)))) | (1<<(4*( 6%8)));} while (0)
#define TIM3CH1toPB4()				pinAFIO(PB4, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 4))) | (/*0b10*/0x02<<(2* 4)); GPIOB->OTYPER &=~(1<< 4); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 4))) | (/*0b01*/0x01<<(2* 4)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 4%8)))) | (1<<(4*( 4%8)));} while (0)
#define TIM3CH2toPA5()				pinAFIO(PA5, AFIO13)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOA->OTYPER &=~(1<< 7); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 7%8)))) | (1<<(4*( 7%8)));} while (0)
#define TIM3CH2toPA7()				pinAFIO(PA7, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOA->OTYPER &=~(1<< 7); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 7%8)))) | (1<<(4*( 7%8)));} while (0)
#define TIM3CH2toPB5()				pinAFIO(PB5, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 5))) | (/*0b10*/0x02<<(2* 5)); GPIOB->OTYPER &=~(1<< 5); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 5))) | (/*0b01*/0x01<<(2* 5)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 5%8)))) | (1<<(1*( 5%8)));} while (0)
#define TIM3CH3toPB0()				pinAFIO(PB0, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 0))) | (/*0b10*/0x02<<(2* 0)); GPIOB->OTYPER &=~(1<< 0); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 0))) | (/*0b01*/0x01<<(2* 0)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 0%8)))) | (1<<(4*( 0%8)));} while (0)
#define TIM3CH3toPF3()				pinAFIO(PF3, AFIO13)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 0))) | (/*0b10*/0x02<<(2* 0)); GPIOB->OTYPER &=~(1<< 0); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 0))) | (/*0b01*/0x01<<(2* 0)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 0%8)))) | (1<<(4*( 0%8)));} while (0)
#define TIM3CH4toPB1()				pinAFIO(PB1, AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 1))) | (/*0b10*/0x02<<(2* 1)); GPIOB->OTYPER &=~(1<< 1); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 1))) | (/*0b01*/0x01<<(2* 1)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 1%8)))) | (1<<(4*( 1%8)));} while (0)

#define TIM14CH1toPA4()				pinAFIO(PA4, AFIO4)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 4))) | (/*0b10*/0x02<<(2* 4)); GPIOA->OTYPER &=~(1<< 4); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 4))) | (/*0b01*/0x01<<(2* 4)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 4%8)))) | (4<<(4*( 4%8)));} while (0)
#define TIM14CH1toPA7()				pinAFIO(PA7, AFIO4)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOA->OTYPER &=~(1<< 7); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 7%8)))) | (4<<(4*( 7%8)));} while (0)
#define TIM14CH1toPB1()				pinAFIO(PB1, AFIO0)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 1))) | (/*0b10*/0x02<<(2* 1)); GPIOB->OTYPER &=~(1<< 1); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 1))) | (/*0b01*/0x01<<(2* 1)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 1%8)))) | (0<<(4*( 1%8)));} while (0)
#define TIM14CH1toPF0()				pinAFIO(PF0, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 1))) | (/*0b10*/0x02<<(2* 1)); GPIOB->OTYPER &=~(1<< 1); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 1))) | (/*0b01*/0x01<<(2* 1)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 1%8)))) | (0<<(4*( 1%8)));} while (0)
#define TIM14CH1toPF1()				pinAFIO(PF1, AFIO13)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 1))) | (/*0b10*/0x02<<(2* 1)); GPIOB->OTYPER &=~(1<< 1); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 1))) | (/*0b01*/0x01<<(2* 1)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 1%8)))) | (0<<(4*( 1%8)));} while (0)

//MODER=/*0b10*/0x02 (alternate function), OTYPER=(push-pull), OSPEEDR = medium speed
//Alternate function = 0, AFR[0]/low byte
#define TIM15CH1toPA2()				pinAFIO(PA2, AFIO0)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 2))) | (/*0b10*/0x02<<(2* 2)); GPIOA->OTYPER &=~(1<< 2); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 2))) | (/*0b01*/0x01<<(2* 2)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 2%8)))) | (0<<(4*( 2%8)));} while (0)
#define TIM15CH2toPA3()				pinAFIO(PA3, AFIO0)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 3))) | (/*0b10*/0x02<<(2* 3)); GPIOA->OTYPER &=~(1<< 3); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 3))) | (/*0b01*/0x01<<(2* 3)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 3%8)))) | (0<<(4*( 3%8)));} while (0)
//AF=1, AFR[1]/high byte
#define TIM15CH1toPB14()			pinAFIO(PB14,AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2*14))) | (/*0b10*/0x02<<(2*14)); GPIOB->OTYPER &=~(1<<14); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2*14))) | (/*0b01*/0x01<<(2*14)); GPIOB->AFR[1] = (GPIOB->AFR[1] &~(0x0f<<(4*(14%8)))) | (1<<(4*(14%8)));} while (0)
#define TIM15CH2toPB15()			pinAFIO(PB15,AFIO1)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2*15))) | (/*0b10*/0x02<<(2*15)); GPIOB->OTYPER &=~(1<<15); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2*15))) | (/*0b01*/0x01<<(2*15)); GPIOB->AFR[1] = (GPIOB->AFR[1] &~(0x0f<<(4*(15%8)))) | (1<<(4*(15%8)));} while (0)
#define TIM15CH1NtoPB15()			pinAFIO(PB15,AFIO3)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2*15))) | (/*0b10*/0x02<<(2*15)); GPIOB->OTYPER &=~(1<<15); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2*15))) | (/*0b01*/0x01<<(2*15)); GPIOB->AFR[1] = (GPIOB->AFR[1] &~(0x0f<<(4*(15%8)))) | (3<<(4*(15%8)));} while (0)

//MODER=/*0b10*/0x02 (alternate function), OTYPER=(push-pull), OSPEEDR = medium speed
//Alternate function = 5, AFR[0]/low byte
#define TIM16CH1toPA6()				pinAFIO(PA6, AFIO5)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 6))) | (/*0b10*/0x02<<(2* 6)); GPIOA->OTYPER &=~(1<< 6); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 6))) | (/*0b01*/0x01<<(2* 6)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 6%8)))) | (5<<(4*( 6%8)));} while (0)
//AF2, AFR[1]/high byte
#define TIM16CH1toPB8()				pinAFIO(PB8, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 8))) | (/*0b10*/0x02<<(2* 8)); GPIOB->OTYPER &=~(1<< 8); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 8))) | (/*0b01*/0x01<<(2* 8)); GPIOB->AFR[1] = (GPIOB->AFR[1] &~(0x0f<<(4*( 8%8)))) | (2<<(4*( 8%8)));} while (0)
#define TIM16CH1NtoPB6()			pinAFIO(PB6, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 6))) | (/*0b10*/0x02<<(2* 6)); GPIOB->OTYPER &=~(1<< 6); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 6))) | (/*0b01*/0x01<<(2* 6)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 6%8)))) | (2<<(4*( 6%8)));} while (0)

//MODER=/*0b10*/0x02 (alternate function), OTYPER=(push-pull), OSPEEDR = medium speed
//Alternate function = 5, AFR[0]/low byte
#define TIM17CH1toPA7()				pinAFIO(PA7, AFIO5)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOAEN; GPIOA->MODER = (GPIOA->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOA->OTYPER &=~(1<< 7); GPIOA->OSPEEDR = (GPIOA->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOA->AFR[0] = (GPIOA->AFR[0] &~(0x0f<<(4*( 7%8)))) | (5<<(4*( 7%8)));} while (0)
//AF2, AFR[1]/high byte
#define TIM17CH1toPB8()				pinAFIO(PB8, AFIO13)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 9))) | (/*0b10*/0x02<<(2* 9)); GPIOB->OTYPER &=~(1<< 9); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 9))) | (/*0b01*/0x01<<(2* 9)); GPIOB->AFR[1] = (GPIOB->AFR[1] &~(0x0f<<(4*( 9%8)))) | (2<<(4*( 9%8)));} while (0)
#define TIM17CH1NtoPB7()			pinAFIO(PB7, AFIO2)	//do {RCC->AHBENR |= RCC_AHBENR_GPIOBEN; GPIOB->MODER = (GPIOB->MODER &~(/*0b11*/0x03<<(2* 7))) | (/*0b10*/0x02<<(2* 7)); GPIOB->OTYPER &=~(1<< 7); GPIOB->OSPEEDR = (GPIOB->OSPEEDR &~(/*0b11*/0x03<<(2* 7))) | (/*0b01*/0x01<<(2* 7)); GPIOB->AFR[0] = (GPIOB->AFR[0] &~(0x0f<<(4*( 7%8)))) | (2<<(4*( 7%8)));} while (0)

//spi pins
#define NSS1toPA4()					pinAFIO(PA4, AFIO0)
#define NSS1toPA15()				pinAFIO(PA15,AFIO0)
#define NSS1toPB12()				pinAFIO(PB12,AFIO0)
#define SCK1toPA5()					pinAFIO(PA5, AFIO0)
#define SCK1toPB3()					pinAFIO(PB3, AFIO0)
#define SCK1toPB13()				pinAFIO(PB13,AFIO0)
#define MOSI1toPA7()				pinAFIO(PA7, AFIO0)
#define MOSI1toPB5()				pinAFIO(PB5, AFIO0)
#define MOSI1toPB15()				pinAFIO(PB15,AFIO0)
#define MISO1toPA6()				pinAFIO(PA6, AFIO0)
#define MISO1toPB4()				pinAFIO(PB4, AFIO0)
#define MISO1toPB14()				pinAFIO(PB14,AFIO0)

//i2c1 pins
#define SCL1toPA3()					pinAFIO(PA3, AFIO12)
#define SCL1toPA8()					pinAFIO(PA8, AFIO12)
#define SCL1toPA9()					pinAFIO(PA9, AFIO6)
#define SCL1toPA10()				pinAFIO(PA10,AFIO12)
#define SCL1toPA11()				pinAFIO(PA11,AFIO6)
#define SCL1toPB6()					pinAFIO(PB6, AFIO6)
#define SCL1toPB8()					pinAFIO(PB8, AFIO6)
#define SCL1toPF1()					pinAFIO(PF1, AFIO12)
#define SDA1toPA2()					pinAFIO(PA2, AFIO12)
#define SDA1toPA7()					pinAFIO(PA7, AFIO12)
#define SDA1toPA9()					pinAFIO(PA9, AFIO12)
#define SDA1toPA10()				pinAFIO(PA10,AFIO6)
#define SDA1toPA12()				pinAFIO(PA12,AFIO6)
#define SDA1toPB7()					pinAFIO(PB7, AFIO6)
#define SDA1toPB8()					pinAFIO(PB8, AFIO12)
#define SDA1toPF0()					pinAFIO(PF0, AFIO12)

//others
#define MCOtoPA1()					pinAFIO(PA1, AFIO15)	//mco on pa1@af15
#define MCOtoPA5()					pinAFIO(PA5, AFIO15)	//mco on pa5@af15
#define MCOtoPA8()					pinAFIO(PA8, AFIO5)		//mco on pa8@af5
#define MCOtoPA9()					pinAFIO(PA9, AFIO5)		//mco on pa9@af5
#define MCOtoPA13()					pinAFIO(PA13,AFIO15)	//mco on pa13@af15
#define MCOtoPA14()					pinAFIO(PA14,AFIO15)	//mco on pa14@af15
#define MCOtoPF2()					pinAFIO(PF2, AFIO6)		//mco on pf2@af6

//swc(pad14)/swd(pa13) pins
#define SWDtoPA13()					pinAFIO(PA13,AFIO0)
#define SWCtoPA14()					pinAFIO(PA14,AFIO0)
#define PA13toSWD()					SWDtoPA13()				//pinAFIO(PA13,AFIO0)
#define PA14toSWC()					SWCtoPA14()				//pinAFIO(PA14,AFIO0)

//end pin config

//for compatability with CoIDE
/**
 * @brief In the following line adjust the External High Speed oscillator (HSE) Startup 
   Timeout value 
   */
#if !defined  (HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT   ((uint16_t)0x5000) /*!< Time out for HSE start up */
#endif /* HSE_STARTUP_TIMEOUT */

/**
 * @brief In the following line adjust the Internal High Speed oscillator (HSI) Startup 
   Timeout value 
   */
#if !defined  (HSI_STARTUP_TIMEOUT)
#define HSI_STARTUP_TIMEOUT   ((uint16_t)0x5000) /*!< Time out for HSI start up */
#endif /* HSI_STARTUP_TIMEOUT */


