dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.h
//pwm output
//dc = 0x00..0x0fff for pwm2/3/4/5, 0x00..0xffff for pwm1
//RP4=PWM1, RP12=PWM2, RP13=PWM3, RP14=PWM4, RP15=PWM5
void analogWrite(uint8_t pin, uint16_t dc);

//analog read on ADC1
//read DRL first for right aligned results
//uint16_t analogRead(uint8_t pin);

//analog reference - default to AVdd-AVss
//Vref sources: 0->Vref = AVdd-AVss, 1->Vref+-AVss, 2->AVdd-Vref-, 3->Vref+ - Vref-
//void analogReference(uint8_t Vref);

//interrupts
//install external interrupt handler
//mode 1: falling edge, 0: rising edge
//void attachInterrupt(uint8_t intx, void (*isrptr) (void), uint8_t mode);
//void detachInterrupt(uint8_t intx);

//change notification interrupts
//install user CN interrupt handler
//void attachCNInterrupt(void (*isrptr) (void));
//void detachCNInterrupt(void);
//void activateCNInterrupt(uint8_t cnx, uint8_t pue);
//void deactivateCNInterrupt(uint8_t cnx);

//global defines
#define IDCODE				(DBGMCU->IDCODE)
#define CPUID				(SCB->CPUID)
//128byte unique id
//usage: UID[0]..UID[127]
#define UID					((char *) 0x1fff0e00)


//global variables

//empty interrupt handler
void empty_handler(void);


//reset the mcu
void mcuInit(void);

//activate the isr handler
void systickAttachISR(void (*isrptr)(void));

//#define Mhz					000000ul	//suffix for Mhz
#define F_UART				(F_PHB)	//8Mhz		//crystal frequency
#define UART_BR300			300ul		//buadrate=300
#define UART_BR600			600ul		//buadrate=600
#define UART_BR1200			1200ul		//buadrate=1200
#define UART_BR2400			2400ul		//buadrate=2400
#define UART_BR4800			4800ul		//buadrate=4800
#define UART_BR9600			9600ul		//buadrate=9600
#define UART_BR14400		14400ul		//buadrate=19200
#define UART_BR19200		19200ul		//buadrate=19200
#define UART_BR38400		38400ul		//buadrate=38400
#define UART_BR43000		43000ul		//buadrate=38400
#define UART_BR57600		57600ul		//buadrate=57600
#define UART_BR76800		76800ul		//buadrate=57600
#define UART_BR115200		115200ul	//buadrate=115200
#define UART_BR128000		128000ul	//buadrate=115200
#define UART_BR230400		230400ul	//buadrate=115200
#define UART_BR256000		256000ul	//buadrate=115200
#define UART_BR460800		460800ul	//buadrate=115200
#define UART_BR512000		512000ul	//buadrate=115200
#define UART_BR576000		576000ul	//buadrate=115200
#define UART_BR921600		921600ul	//buadrate=115200
#define UART_BR1000000		1000000ul	//buadrate=115200
#define UART_BR1250000		1250000ul	//buadrate=115200
#define UART_BR1500000		1500000ul	//buadrate=115200
#define UART_BR2000000		2000000ul	//buadrate=115200
//short notations
#define UART_BR0K3			UART_BR300
#define UART_BR0K6			UART_BR600
#define UART_BR1K2			UART_BR1200
#define UART_BR2K4			UART_BR2400
#define UART_BR4K8			UART_BR4800
#define UART_BR9K6			UART_BR9600
#define UART_BR14K4			UART_BR14400
#define UART_BR19K2			UART_BR19200
#define UART_BR38K4			UART_BR38400
#define UART_BR43K			UART_BR43000
#define UART_BR57K6			UART_BR57600
#define UART_BR76K8			UART_BR76800
#define UART_BR115K2		UART_BR115200
#define UART_BR128K			UART_BR128000
#define UART_BR256K			UART_BR256000
#define UART_BR460K8		UART_BR460800
#define UART_BR512K			UART_BR512000
#define UART_BR576K			UART_BR576000
#define UART_BR921K6		UART_BR921600
#define UART_BR1M			UART_BR1000000
#define UART_BR1M25			UART_BR1250000
#define UART_BR1M5			UART_BR1500000
#define UART_BR2M			UART_BR2000000
//for compatability
#define uart1Put(ch)		uart1Putch(ch)
#define uart1Get()			uart1Getch()

//initiate the hardware usart
void uart1Init(unsigned long baud_rate);
void uart1Putch(char ch);
void uart1Puts(char *str);
uint16_t uart1Available(void);
uint16_t uart1Busy(void);

void uart1Putline(char *ln);
//read a char from usart
uint8_t uart1Getch(void);
void u1Print(char *str, int32_t dat);
#define u1Println()			uart1Puts("\r\n")
#define uart1bps()			(F_UART / USART1->BRR)
#define u1bps()				uart1bps()

//for compatability
#define uart2Put(ch)		uart2Putch(ch)
#define uart2Get()			uart2Getch()
//initiate the hardware usart
void uart2Init(unsigned long baud_rate);
void uart2Putch(char ch);
void uart2Puts(char *str);
uint16_t uart2Available(void);
uint16_t uart2Busy(void);
void uart2Putline(char *ln);

//read a char from usart
uint8_t uart2Getch(void);
void u2Print(char *str, int32_t dat);
#define u2Println()			uart2Puts("\r\n")
#define uart2bps()			(F_UART / USART2->BRR)
#define u2bps()				uart2bps()

//for compatability
#define uart3Put(ch)		uart3Putch(ch)
#define uart3Get()			uart3Getch()
//initiate the hardware usart
void uart3Init(unsigned long baud_rate);
void uart3Putch(char ch);
void uart3Puts(char *str);
uint16_t uart3Available(void);
uint16_t uart3Busy(void);
void uart3Putline(char *ln);

//read a char from usart
uint8_t uart3Getch(void);
void u2Print(char *str, int32_t dat);
#define u3Println()			uart3Puts("\r\n")
#define uart3bps()			(F_UART / USART3->BRR)
#define u3bps()				uart3bps()

//for compatability
#define uart4Put(ch)		uart4Putch(ch)
#define uart4Get()			uart4Getch()
//initiate the hardware usart
void uart4Init(unsigned long baud_rate);
void uart4Putch(char ch);
void uart4Puts(char *str);
uint16_t uart4Available(void);
uint16_t uart4Busy(void);
void uart4Putline(char *ln);

//read a char from usart
uint8_t uart4Getch(void);
void u2Print(char *str, int32_t dat);
#define u4Println()			uart4Puts("\r\n")
#define uart4bps()			(F_UART / USART4->BRR)
#define u4bps()				uart4bps()
//end Serial

//timers
#define tmrCC1Get(tmr)		(tmr->CCR1)
#define tmrCC2Get(tmr)		(tmr->CCR2)
#define tmrCC3Get(tmr)		(tmr->CCR3)
#define tmrCC4Get(tmr)		(tmr->CCR4)
//initialize the timer1 (16bit)
void tmr1Init(uint16_t ps);							//initialize timer with a prescaler
#define tmr1Get()			(TIM1->CNT)
#define tmr1SetPS(ps)		TIM1->PSC = (ps) - 1	//void tmr1SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr1GetPS()			(TIM1->PSC + 1l)		
#define tmr1SetPR(pr)		TIM1->ARR = (pr) - 1	//void tmr1SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr1GetPR()			(TIM1->ARR + 1l)		
void tmr1OVFAttachISR(void (*isrptr)(void));		//activate the ovf isr handler
//output compare
void tmr1OC1SetPR(uint16_t pr);						//set period
void tmr1OC1AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr1OC2SetPR(uint16_t pr);						//set period
void tmr1OC2AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr1OC3SetPR(uint16_t pr);						//set period
void tmr1OC3AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr1OC4SetPR(uint16_t pr);						//set period
void tmr1OC4AttachISR(void (*isrptr)(void));		//activate the isr handler
//input capture
void tmr1IC1Init(uint8_t ps);								//activate input capture
#define tmr1CC1Get()		tmrCC1Get(TIM1)
void tmr1IC2Init(uint8_t ps);								//activate input capture
#define tmr1CC2Get()		tmrCC2Get(TIM1)
void tmr1IC3Init(uint8_t ps);								//activate input capture
#define tmr1CC3Get()		tmrCC3Get(TIM1)
void tmr1IC4Init(uint8_t ps);								//activate input capture
#define tmr1CC4Get()		tmrCC4Get(TIM1)

//TIM2 does not exist on PY32
//#define TIM2_BASE             (APBPERIPH_BASE + 0x0000ul)
//#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
//#define TIM2_IRQn			15
#define RCC_APBENR1_TIM2EN_Pos           (0U)
#define RCC_APBENR1_TIM2EN_Msk           (0x1UL << RCC_APBENR1_TIM2EN_Pos)      /*!< 0x00000001 */
#define RCC_APBENR1_TIM2EN               RCC_APBENR1_TIM2EN_Msk
void tmr2Init(uint16_t ps);							//initialize timer with a prescaler
#define tmr2Get()			(TIM2->CNT)
#define tmr2SetPS(ps)		TIM2->PSC = (ps) - 1	//void tmr2SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr2GetPS()			(TIM2->PSC + 1l)		
#define tmr2SetPR(pr)		TIM2->ARR = (pr) - 1	//void tmr2SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr2GetPR()			(TIM2->ARR + 1l)		
void tmr2OVFAttachISR(void (*isrptr)(void));		//activate the ovf isr handler
//output compare
void tmr2OC1SetPR(uint16_t pr);						//set period
void tmr2OC1AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr2OC2SetPR(uint16_t pr);						//set period
void tmr2OC2AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr2OC3SetPR(uint16_t pr);						//set period
void tmr2OC3AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr2OC4SetPR(uint16_t pr);						//set period
void tmr2OC4AttachISR(void (*isrptr)(void));		//activate the isr handler
//input capture
void tmr2IC1Init(uint8_t ps);								//activate input capture
#define tmr2CC1Get()		tmrCC1Get(TIM2)
void tmr2IC2Init(uint8_t ps);								//activate input capture
#define tmr2CC2Get()		tmrCC2Get(TIM2)
void tmr2IC3Init(uint8_t ps);								//activate input capture
#define tmr2CC3Get()		tmrCC3Get(TIM2)
void tmr2IC4Init(uint8_t ps);								//activate input capture
#define tmr2CC4Get()		tmrCC4Get(TIM2)

//initialize the timer3 (16bit)
void tmr3Init(uint16_t ps);							//initialize timer with a prescaler
#define tmr3Get()			(TIM3->CNT)
#define tmr3SetPS(ps)		TIM3->PSC = (ps) - 1	//void tmr1SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr3GetPS()			(TIM3->PSC + 1l)		
#define tmr3SetPR(pr)		TIM3->ARR = (pr) - 1	//void tmr3SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr3GetPR()			(TIM3->ARR + 1l)		
void tmr3OVFAttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr3OC1SetPR(uint16_t pr);						//set period
void tmr3OC1AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr3OC2SetPR(uint16_t pr);						//set period
void tmr3OC2AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr3OC3SetPR(uint16_t pr);						//set period
void tmr3OC3AttachISR(void (*isrptr)(void));		//activate the isr handler
void tmr3OC4SetPR(uint16_t pr);						//set period
void tmr3OC4AttachISR(void (*isrptr)(void));		//activate the isr handler
//input capture
void tmr3IC1Init(uint8_t ps);								//activate input capture
#define tmr3CC1Get()		tmrCC1Get(TIM3)
void tmr3IC2Init(uint8_t ps);								//activate input capture
#define tmr3CC2Get()		tmrCC2Get(TIM3)
void tmr3IC3Init(uint8_t ps);								//activate input capture
#define tmr3CC3Get()		tmrCC3Get(TIM3)
void tmr3IC4Init(uint8_t ps);								//activate input capture
#define tmr3CC4Get()		tmrCC4Get(TIM3)

