dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.h
//initialize the timer6 (16bit)
void tmr6Init(uint16_t ps);							//initialize timer with a prescaler
#define tmr6Get()			(TIM6->CNT)
#define tmr6SetPS(ps)		TIM6->PSC = (ps) - 1	//void tmr1SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr6GetPS()			(TIM6->PSC + 1l)		
#define tmr6SetPR(pr)		TIM6->ARR = (pr) - 1	//void tmr6SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr6GetPR()			(TIM6->ARR + 1l)		
void tmr6OVFAttachISR(void (*isrptr)(void));		//activate the isr handler
//input capture
void tmr6IC1Init(uint8_t ps);								//activate input capture
#define tmr6CC1Get()		tmrCC1Get(TIM6)
void tmr6IC2Init(uint8_t ps);								//activate input capture
#define tmr6CC2Get()		tmrCC2Get(TIM6)
void tmr6IC3Init(uint8_t ps);								//activate input capture
#define tmr6CC3Get()		tmrCC3Get(TIM6)
void tmr6IC4Init(uint8_t ps);								//activate input capture
#define tmr6CC4Get()		tmrCC4Get(TIM6)

//initialize the timer14 (16bit)
void tmr14Init(uint16_t ps);						//initialize timer with a prescaler
#define tmr14Get()			(TIM14->CNT)
#define tmr14SetPS(ps)		TIM14->PSC = (ps) - 1	//void tmr1SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr14GetPS()		(TIM14->PSC + 1l)		
#define tmr14SetPR(pr)		TIM14->ARR = (pr) - 1	//void tmr14SetPR(uint16_t pr);						//set period
#define tmr14GetPR()		(TIM14->ARR + 1l)		
void tmr14OVFAttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//output compare
void tmr14OC1SetPR(uint16_t pr);					//set period
void tmr14OC1AttachISR(void (*isrptr)(void));		//activate the isr overflow handler
void tmr14OC2SetPR(uint16_t pr);					//set period
void tmr14OC2AttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//input capture
void tmr14IC1Init(uint8_t ps);								//activate input capture
#define tmr14CC1Get()		tmrCC1Get(TIM14)
void tmr14IC2Init(uint8_t ps);								//activate input capture
#define tmr14CC2Get()		tmrCC2Get(TIM14)
void tmr14IC3Init(uint8_t ps);								//activate input capture
#define tmr14CC3Get()		tmrCC3Get(TIM14)
void tmr14IC4Init(uint8_t ps);								//activate input capture
#define tmr14CC4Get()		tmrCC4Get(TIM14)

//initialize the timer15 (16bit)
void tmr15Init(uint16_t ps);						//initialize timer with a prescaler
#define tmr15Get()			(TIM15->CNT)
#define tmr15SetPS(ps)		TIM15->PSC = (ps) - 1	//void tmr1SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr15GetPS()		(TIM15->PSC + 1l)		
#define tmr15SetPR(pr)		TIM15->ARR = (pr) - 1	//void tmr15SetPR(uint16_t pr);						//set period
#define tmr15GetPR()		(TIM15->ARR + 1l)		
void tmr15OVFAttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//output compare
void tmr15OC1SetPR(uint16_t pr);					//set period
void tmr15OC1AttachISR(void (*isrptr)(void));		//activate the isr overflow handler
void tmr15OC2SetPR(uint16_t pr);					//set period
void tmr15OC2AttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//input capture
void tmr15IC1Init(uint8_t ps);								//activate input capture
#define tmr15CC1Get()		tmrCC1Get(TIM15)
void tmr15IC2Init(uint8_t ps);								//activate input capture
#define tmr15CC2Get()		tmrCC2Get(TIM15)
void tmr15IC3Init(uint8_t ps);								//activate input capture
#define tmr15CC3Get()		tmrCC3Get(TIM15)
void tmr15IC4Init(uint8_t ps);								//activate input capture
#define tmr15CC4Get()		tmrCC4Get(TIM15)

//initialize the timer16 (16bit)
void tmr16Init(uint16_t ps);						//initialize timer with a prescaler
#define tmr16Get()			(TIM16->CNT)
#define tmr16SetPS(ps)		TIM16->PSC = (ps) - 1	//void tmr1SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr16GetPS()		(TIM16->PSC + 1l)		
#define tmr16SetPR(pr)		TIM16->ARR = (pr) - 1	//void tmr16SetPR(uint16_t pr);						//set period
#define tmr16GetPR()		(TIM16->ARR + 1l)		
void tmr16OVFAttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//output compare
void tmr16OC1SetPR(uint16_t pr);					//set period
void tmr16OC1AttachISR(void (*isrptr)(void));		//activate the isr overflow handler
void tmr16OC2SetPR(uint16_t pr);					//set period
void tmr16OC2AttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//input capture
void tmr16IC1Init(uint8_t ps);								//activate input capture
#define tmr16CC1Get()		tmrCC1Get(TIM16)
void tmr16IC2Init(uint8_t ps);								//activate input capture
#define tmr16CC2Get()		tmrCC2Get(TIM16)
void tmr16IC3Init(uint8_t ps);								//activate input capture
#define tmr16CC3Get()		tmrCC3Get(TIM16)
void tmr16IC4Init(uint8_t ps);								//activate input capture
#define tmr16CC4Get()		tmrCC4Get(TIM16)

//initialize the timer17 (16bit)
void tmr17Init(uint16_t ps);						//initialize timer with a prescaler
#define tmr17Get()			(TIM17->CNT)
#define tmr17SetPS(ps)		TIM17->PSC = (ps) - 1	//void tmr1SetPR(uint16_t pr);						//set period for ovf interupt
#define tmr17GetPS()		(TIM17->PSC + 1l)		
#define tmr17SetPR(pr)		TIM17->ARR = (pr) - 1	//void tmr17SetPR(uint16_t pr);						//set period
#define tmr17GetPR()		(TIM17->ARR + 1l)		
void tmr17OVFAttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//output compare
void tmr17OC1SetPR(uint16_t pr);					//set period
void tmr17OC1AttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//void tmr17OC2SetPR(uint16_t pr);					//set period
//void tmr17OC2AttachISR(void (*isrptr)(void));		//activate the isr overflow handler
//input capture
void tmr17IC1Init(uint8_t ps);								//activate input capture
#define tmr17CC1Get()		tmrCC1Get(TIM17)
void tmr17IC2Init(uint8_t ps);								//activate input capture
#define tmr17CC2Get()		tmrCC2Get(TIM17)
void tmr17IC3Init(uint8_t ps);								//activate input capture
#define tmr17CC3Get()		tmrCC3Get(TIM17)
void tmr17IC4Init(uint8_t ps);								//activate input capture
#define tmr17CC4Get()		tmrCC4Get(TIM17)

//initialize tim31 as a synchronized 32-bit timer
//tim3 as master / lsw (including prescaler) to tim1 / msw of the 32-bit timer
//tim1 as slave / msw of the 32-bit timer
void tmr31Init(uint16_t ps);			//initialize tmr, default period is 0x100000000ul
#define tmr31GetPS()		tmr3GetPS()
#define tmr31SetPS(ps)		tmr3SetPS(ps)
uint32_t tmr31Get(void);				//read 32-bit timer value
uint32_t tmr31SetPR(uint32_t pr);		//set 32-bit timer period
uint32_t tmr31GetPR(void);				//read 32-bit timer period
#define tmr31OVFAttachISR(isrptr)		tmr1OVFAttachISR(isrptr)		//activate the isr handler

