dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.h
void tmr171Init(uint16_t ps);			//initialize tmr, default period is 0x100000000ul
#define tmr171GetPS()		tmr17GetPS()
#define tmr171SetPS(ps)		tmr17SetPS(ps)
uint32_t tmr171Get(void);				//read 32-bit timer value
uint32_t tmr171SetPR(uint32_t pr);		//set 32-bit timer period
uint32_t tmr171GetPR(void);			//read 32-bit timer period
#define tmr171OVFAttachISR(isrptr)		tmr1OVFAttachISR(isrptr)		//activate the isr handler

void tmr13Init(uint16_t ps);			//initialize tmr, default period is 0x100000000ul
#define tmr13GetPS()		tmr1GetPS()
#define tmr13SetPS(ps)		tmr1SetPS(ps)
uint32_t tmr13Get(void);				//read 32-bit timer value
uint32_t tmr13SetPR(uint32_t pr);		//set 32-bit timer period
uint32_t tmr13GetPR(void);				//read 32-bit timer period
#define tmr13OVFAttachISR(isrptr)		tmr3OVFAttachISR(isrptr)		//activate the isr handler

void tmr143Init(uint16_t ps);			//initialize tmr, default period is 0x100000000ul
#define tmr143GetPS()		tmr14GetPS()
#define tmr143SetPS(ps)		tmr14SetPS(ps)
uint32_t tmr143Get(void);				//read 32-bit timer value
uint32_t tmr143SetPR(uint32_t pr);		//set 32-bit timer period
uint32_t tmr143GetPR(void);				//read 32-bit timer period
#define tmr143OVFAttachISR(isrptr)		tmr3OVFAttachISR(isrptr)		//activate the isr handler

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm1Init(uint16_t TxCCP_PS);
#define pwm1GetPS()			tmr1GetPS()
#define pwm1SetPS(ps)		tmr1SetPS(ps)
#define pwm1GetPR()			tmr1GetPR()
#define pwm1SetPR(pr)		tmr1SetPR(pr)
//set duty cycle
#define pwm1SetDC1(dc)		TIM1->CCR1 = (dc)
#define pwm1SetDC2(dc)		TIM1->CCR2 = (dc)
#define pwm1SetDC3(dc)		TIM1->CCR3 = (dc)
#define pwm1SetDC4(dc)		TIM1->CCR4 = (dc)
#define pwm1GetDC1()		(TIM1->CCR1)
#define pwm1GetDC2()		(TIM1->CCR2)
#define pwm1GetDC3()		(TIM1->CCR3)
#define pwm1GetDC4()		(TIM1->CCR4)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm2Init(uint16_t TxCCP_PS);
#define pwm2GetPS()			tmr2GetPS()
#define pwm2SetPS(ps)		tmr2SetPS(ps)
#define pwm2GetPR()			tmr2GetPR()
#define pwm2SetPR(pr)		tmr2SetPR(pr)
//set duty cycle
#define pwm2SetDC1(dc)		TIM2->CCR1 = (dc)
#define pwm2SetDC2(dc)		TIM2->CCR2 = (dc)
#define pwm2SetDC3(dc)		TIM2->CCR3 = (dc)
#define pwm2SetDC4(dc)		TIM2->CCR4 = (dc)
#define pwm2GetDC1()		(TIM2->CCR1)
#define pwm2GetDC2()		(TIM2->CCR2)
#define pwm2GetDC3()		(TIM2->CCR3)
#define pwm2GetDC4()		(TIM2->CCR4)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm3Init(uint16_t TxCCP_PS);
#define pwm3GetPS()			tmr3GetPS()
#define pwm3SetPS(ps)		tmr3SetPS(ps)
#define pwm3GetPR()			tmr3GetPR()
#define pwm3SetPR(pr)		tmr3SetPR(pr)
//set duty cycle
#define pwm3SetDC1(dc)		TIM3->CCR1 = (dc)
#define pwm3SetDC2(dc)		TIM3->CCR2 = (dc)
#define pwm3SetDC3(dc)		TIM3->CCR3 = (dc)
#define pwm3SetDC4(dc)		TIM3->CCR4 = (dc)
#define pwm3GetDC1()		(TIM3->CCR1)
#define pwm3GetDC2()		(TIM3->CCR2)
#define pwm3GetDC3()		(TIM3->CCR3)
#define pwm3GetDC4()		(TIM3->CCR4)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm14Init(uint16_t TxCCP_PS);
#define pwm14GetPS()		tmr14GetPS()
#define pwm14SetPS(ps)		tmr14SetPS(ps)
#define pwm14GetPR()		tmr14GetPR()
#define pwm14SetPR(pr)		tmr14SetPR(pr)
//set duty cycle
#define pwm14SetDC1(dc)		TIM14->CCR1 = (dc)
#define pwm14SetDC2(dc)		TIM14->CCR2 = (dc)
#define pwm14SetDC3(dc)		TIM14->CCR3 = (dc)
#define pwm14SetDC4(dc)		TIM14->CCR4 = (dc)
#define pwm14GetDC1()		(TIM14->CCR1)
#define pwm14GetDC2()		(TIM14->CCR2)
#define pwm14GetDC3()		(TIM14->CCR3)
#define pwm14GetDC4()		(TIM14->CCR4)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm15Init(uint16_t TxCCP_PS);
#define pwm15GetPS()		tmr15GetPS()
#define pwm15SetPS(ps)		tmr15SetPS(ps)
#define pwm15GetPR()		tmr15GetPR()
#define pwm15SetPR(pr)		tmr15SetPR(pr)
//set duty cycle
#define pwm15SetDC1(dc)		TIM15->CCR1 = (dc)
#define pwm15SetDC2(dc)		TIM15->CCR2 = (dc)
#define pwm15SetDC3(dc)		TIM15->CCR3 = (dc)
#define pwm15SetDC4(dc)		TIM15->CCR4 = (dc)
#define pwm15GetDC1()		(TIM15->CCR1)
#define pwm15GetDC2()		(TIM15->CCR2)
#define pwm15GetDC3()		(TIM15->CCR3)
#define pwm15GetDC4()		(TIM15->CCR4)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm16Init(uint16_t TxCCP_PS);
#define pwm16GetPS()		tmr16GetPS()
#define pwm16SetPS(ps)		tmr16SetPS(ps)
#define pwm16GetPR()		tmr16GetPR()
#define pwm16SetPR(pr)		tmr16SetPR(pr)
//set duty cycle
#define pwm16SetDC1(dc)		TIM16->CCR1 = (dc)
#define pwm16SetDC2(dc)		TIM16->CCR2 = (dc)
#define pwm16SetDC3(dc)		TIM16->CCR3 = (dc)
#define pwm16SetDC4(dc)		TIM16->CCR4 = (dc)
#define pwm16GetDC1()		(TIM16->CCR1)
#define pwm16GetDC2()		(TIM16->CCR2)
#define pwm16GetDC3()		(TIM16->CCR3)
#define pwm16GetDC4()		(TIM16->CCR4)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm17Init(uint16_t TxCCP_PS);
#define pwm17GetPS()		tmr17GetPS()
#define pwm17SetPS(ps)		tmr17SetPS(ps)
#define pwm17GetPR()		tmr17GetPR()
#define pwm17SetPR(pr)		tmr17SetPR(pr)
//set duty cycle
#define pwm17SetDC1(dc)		TIM17->CCR1 = (dc)
#define pwm17SetDC2(dc)		TIM17->CCR2 = (dc)
#define pwm17SetDC3(dc)		TIM17->CCR3 = (dc)
#define pwm17SetDC4(dc)		TIM17->CCR4 = (dc)
#define pwm17GetDC1()		(TIM17->CCR1)
#define pwm17GetDC2()		(TIM17->CCR2)
#define pwm17GetDC3()		(TIM17->CCR3)
#define pwm17GetDC4()		(TIM17->CCR4)

//lptimer

//initialize lptimer
void lptmr1Init(uint8_t ps);					//initialize lptimer1. ps=0..7->1x..128x
void lptmr1AttachISR(void (*isr_ptr)(void));	//install user handler
#define lptmr1Start()	LPTIM1->CR |= LPTIM_CR_SNGSTRT
#define lptmr1OVF()		(LPTIM1->ISR & LPTIM_ISR_ARRM)
#define lptmr1SetPR(pr)	LPTIM1->ARR = (pr) - 1
#define lptmr1GetPR()	(LPTIM1->ARR + 1ul)
#define lptmr1SetPS(ps)	LPTIM1->CFGR = (LPTIM1->CFGR &~LPTIM_CFGR_PRESC) | (((ps) << LPTIM_CFGR_PRESC_Pos) & LPTIM_CFGR_PRESC)
#define lptmr1GetPS()	((LPTIM1->CFGR & LPTIM_CFGR_PRESC) >> LPTIM_CFGR_PRESC_Pos)
//end lptimer

//adc
//adc channel definitions
#define ADC_CH0			0
#define ADC_CH1			1
#define ADC_CH2			2
#define ADC_CH3			3
#define ADC_CH4			4
#define ADC_CH5			5
#define ADC_CH6			6
#define ADC_CH7			7
#define ADC_CH8			8
#define ADC_CH9			9
//#define ADC_CH10		10
#define ADC_CH11		11
#define ADC_CH12		12
//#define ADC_CH13		(1ul<<13)
//#define ADC_CH14		(1ul<<14)
//#define ADC_CH15		(1ul<<15)
//#define ADC_CH16		(1ul<<16)
//#define ADC_CH17		(1ul<<17)
#define ADC_TS			ADC_CH11				//tempeature sensor on CH11
#define ADC_VREFINT		ADC_CH12				//internal reference on CH12 @ 1.20v
#define ADC_VREF		ADC_VREFINT				//internal reference on CH12 @ 1.20v
#define ADC_TEMP		ADC_TS					//internal reference on CH11 @ 1.20v
#define ADC_ARAND		ADC_VREFINT				//the channel for random number generators

//calibration for temperature sensors, 12 bits
#define TSCAL1			((*(int32_t *) 0x1fff0f14) & 0x0fff)		//~941 @ VddA=3.3v
#define TSCAL2			((*(int32_t *) 0x1fff0f18) & 0x0fff)		//~1130

//convert temperature sensor adc reading into temperaturex10
//two alternatives to calculate temperature. both work
#define ADC2Cx100(adc)		((8500 - 3000) * ((adc) * VDDAmv / 3000 - TSCAL1) / (TSCAL2 - TSCAL1) + 3000)	//per reference manual - need to correct adc reading due to VDDA differences
//#define ADC2Cx100(adc)		((760 - ADC2mv(adc)) * 10 * 100 / (25) + 3000)					//per datasheet, using average slope. 
#define ADC2Fx100(adc)		(ADC2Cx100(adc) * 9 / 5 + 3200)
#define VREFadc				1487l					//VREF ADC reading
#define VREFmv				1200l					//Vref voltage in mv
#define VDDAmv				(VREFmv * 4096 / VREFadc)	//VADD=3.3v
#define ADC2mv(adc)			((adc) * VDDAmv / 4096)	//convert 12-bit adc to mv
//rest the adc
//automatic sampling (ASAM=1), manual conversion
void adc1Init(void);
int16_t adc1Read(uint32_t adc_ch);

//read the adc
#define analogRead(ch)	adc1Read(ch)
//end ADC

//input capture
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic1Init(void);
void ic1AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic1Get(void);							//read buffer value

