dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.h
void ic2Init(void);
void ic2AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic2Get(void);							//read buffer value

void ic3Init(void);
void ic3AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic3Get(void);							//read buffer value

void ic4Init(void);
void ic4AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic4Get(void);							//read buffer value

void ic5Init(void);
void ic5AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic5Get(void);							//read buffer value
//end input capture

//int
void int0Init(void);							//initialize the module
void int0AttachISR(void (*isrptr) (void));		//attach user isr

void int1Init(void);							//initialize the module
void int1AttachISR(void (*isrptr) (void));		//attach user isr

void int2Init(void);							//initialize the module
void int2AttachISR(void (*isrptr) (void));		//attach user isr

void int3Init(void);							//initialize the module
void int3AttachISR(void (*isrptr) (void));		//attach user isr

void int4Init(void);							//initialize the module
void int4AttachISR(void (*isrptr) (void));		//attach user isr
//end int

//spi
void spi1Init(uint32_t br);							//reset the spi
#define spi1Busy()			(SPI1->SR & SPI_SR_BSY)	//transmit buffer full, must wait before writing to SPIxBUF
#define spi1Avail()			(SPI1->SR & SPI_SR_RXNE)	//receive buffer not empty -> there is data
#define spi1Wait()			while (spi1Busy()) continue
#define spi1Write(dat)		do {spi1Wait(); SPI1->DR = (dat);} while (0)
#define spi1Read()			(SPI1->DR)				//read from the buffer

void spi2Init(uint32_t br);							//reset the spi
#define spi2Busy()			(SPI2->SR & SPI_SR_BSY)	//transmit buffer full, must wait before writing to SPIxBUF
#define spi2Avail()			(SPI2->SR & SPI_SR_RXNE)	//receive buffer not empty -> there is data
#define spi2Wait()			while (spi2Busy()) continue
#define spi2Write(dat)		do {spi2Wait(); SPI2->DR = (dat);} while (0)
#define spi2Read()			(SPI2->DR)				//read from the buffer
//end spi


//i2c
#define I2C_CMD_WRITE		0						//write command
#define I2C_CMD_READ		1						//read command

void i2c1Init(uint32_t br);							//i2c1 initialization
#define i2c1Busy()			(I2C1->SR2 & I2C_SR2_BUSY)
#define i2c1Wait()			while (i2c1Busy()) continue
#define i2c1Avail()			(I2C1->SR1 & I2C_SR1_RXNE)
#define i2c1Start()			do {I2C1->CR1 |= I2C_CR1_START; while (!I2C1->SR1 & I2C_SR1_SB) continue; I2C1->SR1;} while (0)
#define i2c1WriteAddr(dat)	do {I2C1->DR = (dat); while (!I2C1->SR1 & I2C_SR1_ADDR) continue; I2C1->SR1; I2C1->SR2;} while (0)
#define i2c1Write(dat)		do {I2C1->DR = (dat); while (!I2C1->SR1 & I2C_SR1_TXE) continue; } while (0)
#define i2c1Stop()			do {I2C1->CR1 |= I2C_CR1_STOP;} while (0)
#define i2c1Ack()			do {I2C1->CR1 |= I2C_CR1_ACK;} while (0)
#define i2c1NoAck()			do {I2C1->CR1 &=~I2C_CR1_ACK;} while (0)
int16_t i2c1Writes(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t* pBuffer, uint16_t NumByteToWrite);	//WRITE_REG multiple bytes
int16_t i2c1Reads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t* pBuffer, uint16_t NumByteToRead);	//READ_BIT multiple bytes
//end i2c

//rtc
#define RCC_BDCR_RTCSEL_NOCLK		(0ul<<RCC_BDCR_RTCSEL_Pos)
#define RCC_BDCR_RTCSEL_LSE			(1ul<<RCC_BDCR_RTCSEL_Pos)
#define RCC_BDCR_RTCSEL_LSI			(2ul<<RCC_BDCR_RTCSEL_Pos)
#define RCC_BDCR_RTCSEL_HSE			(3ul<<RCC_BDCR_RTCSEL_Pos)
//#define RCC_BDCR_LSEON				(1ul<<0)
//#define RCC_BDCR_LSERDY				(1ul<<1)
//bcd to dec conversion
#define BCD2DEC(bcd)				((((bcd) & 0xf0)>>4)*10+((bcd) & 0x0f))		//convert bcd to int
#define DEC2BCD(dec)				(((((dec) / 10)<<4) +((dec) % 10)) & 0xff)	//convert int to bcd
//rtc
//reset the rtc
//ps = prescaler
//pr = period for alarm
//alarm isr is enabled
//rtcc_clk is clock source:
//RCC_BDCR_RTCSEL_LSI, RCC_BDCR_RTCSEL_LSE and RCC_BDCR_RTCSEL_HSE (HSE/128)
void RTCInit(uint32_t rtc_clk, uint32_t ps);	//initialize the RTCC
void RTCOVFAttachISR(void (*isr_ptr)(void));			//install rtc overflow isr
void RTCALRAttachISR(void (*isr_ptr)(void));			//install rtc alarm isr
void RTCSECAttachISR(void (*isr_ptr)(void));			//install rtc second isr
uint32_t RTCSetCNT(uint32_t val);				//set rtc counter
uint32_t RTCGetCNT(void);						//read rtc counter
uint32_t RTCSetALR(uint32_t val);				//set rtc alarm counter
uint32_t RTCGetALR(void);						//read rtc alarm counter
#define	isRTCALR()				(RTC->CRL & RTC_CRL_ALRF)
#define	isRTCSEC()				(RTC->CRL & RTC_CRL_SECF)
#define	isRTCOW()				(RTC->CRL & RTC_CRL_OWF)
#define RTCClrALR()				do {PWR->CR1 |= PWR_CR1_DBP; RTC->CRL |= RTC_CRL_CNF; RTC->CRL &=~RTC_CRL_ALRF; RTC->CRL &=~RTC_CRL_CNF; PWR->CR1 &=~PWR_CR1_DBP;	} while (0)
#define RTCClrSEC()				do {PWR->CR1 |= PWR_CR1_DBP; RTC->CRL |= RTC_CRL_CNF; RTC->CRL &=~RTC_CRL_SECF; RTC->CRL &=~RTC_CRL_CNF; PWR->CR1 &=~PWR_CR1_DBP;	} while (0)
#define RTCClrOW()				do {PWR->CR1 |= PWR_CR1_DBP; RTC->CRL |= RTC_CRL_CNF; RTC->CRL &=~RTC_CRL_OWF;  RTC->CRL &=~RTC_CRL_CNF; PWR->CR1 &=~PWR_CR1_DBP;	} while (0)
#define RTCGetSec()				RTCGetCNT()
#define RTCSetSec(sec)			RTCSetCNT(sec)
#define RTCInitLSI()			RTCInit(RCC_BDCR_RTCSEL_LSI, F_LSI)
#define RTCInitLSE()			RTCInit(RCC_BDCR_RTCSEL_LSE, F_LSE)
#define RTCInitHSE()			RTCInit(RCC_BDCR_RTCSEL_HSE, F_HSE/128)
#define RTCTrimSet(trim)		do {PWR->CR1 |= PWR_CR1_DBP; RTC->BKP_RTCCR = (RTC->BKP_RTCCR &~BKP_RTCCR_CAL) | ((trim) & BKP_RTCCR_CAL); PWR->CR1 &=~PWR_CR1_DBP;	} while (0)
#define RTCTrimGet()			(RTC->BKP_RTCCR & BKP_RTCCR_CAL)
	
time_t RTC2time(time_t *t);						//read rtc into time_t
time_t time2RTC(time_t t);						//initialize rtc with time_t

uint32_t RTCGetPRL(void);						//read prll and prlh
uint32_t RTCGetDIV(void);						//read divl and divh
uint8_t RTCHalfsec(void);						//returns 0: if 1st half second, 1: if 2nd half second
//set calibration register
void RTCSetCal(uint8_t cal);					//set calibration: number of ticks to be ignored every 2^20 ticks (it slows down the rtc)
//end rtc

//software rtc

//global variables
typedef struct {
	time_t time;						//second counter since 1/1/1970
	uint32_t tick;						//tick counter at last update
	int16_t cal;						//rtc calibration, in ppm. +=faster, -=slower
	uint8_t halfsec;					//0=first half sec, 1=2nd half sec
} sRTC_TypeDef;

